#Напишите программу, которая на вхо12 принимает число 
# и выдаёт его квадрат (число умноженное на само себя).
digit = int(input("Введите число: "))
print(f"{digit} * {digit} = {digit**2}")